/* Задача 4: Напишите программу, которая принимает на
вход три числа и выдаёт максимальное из этих чисел */

Console.WriteLine("введите целочисленное число 1 ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("введите целочисленное число 2 ");
int number2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("введите целочисленное число 3 ");
int number3 = Convert.ToInt32(Console.ReadLine());
int max = number1;
int cout = 0;
while (cout=2)
{
if
cout++;
}